clear;

n = 0:1:50;
N = 5;

A = [0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0;
    0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0;
    0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0;
    0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0 0;
    0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0 0;
    0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0 0;
    0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0 0;
    0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0 0;
    0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 0;
    0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0 0;
    0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0 0;
    0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0 0;
    0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0 0;
    0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0 0;
    0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0 0;
    0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1 0;
    0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1;
    3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 3 N 0];

P = zeros(18,length(n));
P(:,1) = [0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 0; 2; 2];

for i = 2:length(n)
       P(:,i) = A*P(:,i-1);
end

sum = P(2,:);

for i = 3:16
       sum = sum + P(i,:);
end

semilogy(n,P(1,:),'r'); hold on;
semilogy(n,sum,'b');
semilogy(n,P(17,:),'y');
semilogy(n,P(18,:),'g');

legend('—тарые кролики (18 мес€цев)','3-17-мес€чные кролики',' ролики чуть больше (2 мес€ца)','ћаленькие кролики (1 мес€ц)');
xlabel('¬рем€ в мес€цах');
ylabel(' ролики в лог. масштабе');

D = eig(A);
lambd = log(max(D));
tg = (log(P(18,50)) - log(P(18,40)))/(50-40);


